'use strict';

// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let str = '20';

for (let i = 20.5; i <= 30; i = i + 0.5) {
    str = str + ' ' + i;
}

console.log(str);

// 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

for (let i = 10; i <= 100; i = i + 10)  {

    console.log(`${i} * 27 = ${i * 27}`);

}

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let N = prompt('Add the number');

for (let i = 1; i <= 100; i++)  {

    if (i * i <= N) {
        console.log (i);
    }

}

// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let n4 = prompt('Add the number more then 1');
let sum4 = 0;

for (let i = 2; i <= n4; i++) {

    if (n4 % i === 0) {
        sum4 = sum4 + 1;
    } 
}

if (sum4 === 1) {
    console.log('Ви ввели ' + n4 + ' - це просте число'); 
} else {
    console.log('Ви ввели ' + n4 + ' - це не просте число'); 
}

// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let n5 = prompt('Add the number again');  

for (let i = 1; i <= n5; i++ )  {
    
    if (n5 == 3**i) {
        console.log('Ви ввели число ' + n5 + ', це число можна одержати шляхом зведення числа 3 у деякий ступінь');
        break;
    } else {
        console.log('Ви ввели число, яке не можна одержати шляхом зведення числа 3 у деякий ступінь');
    }

}




  












